// Завдання 1
// Написати розв’язок нижче описаного завдання (по одному рядку коду на кожний пункт)
// 1.	Створіть змінну city з типом даних string.
// 2.	Присвойте їй значення «Київ».
// 3.	Змініть значення змінної city на «Львів».
// 4.	Створіть змінну address з типом даних string і скопіюйте в неї значення змінної city.
// 5.	Вивести значення змінної address з допомогою команди console.log().
let city;
city = 'Kyiv';
city = 'Lviv';
let address;
address = city;
console.log(address);
// ------------------------------------------------------------------------------------------
// Завдання 2
// Використовуючи конструкцію if..else через тернарний вираз, напишіть код, який отримує число через prompt, 
// а потім виводить в console.log() повідомлення:
// 1.	Число парне.
// 2.	Число непарне.
// 3.	Число 0.
let num = +prompt('Введіть число');
(num % 2 == 0 && num != 0) ? console.log('Число парне') :
    (num % 2 != 0 && num != 0) ? console.log('Число непарне') :
        console.log('Число 0');
// ------------------------------------------------------------------------------------------
// Завдання 3
// Написати розв’язок нижче описаного завдання за допомогою function declaration:
// 1.	Потрібно створити функцію, яка повертає максимальний переданий їй числовий параметр.
// 2.	Кількість параметрів у функції може бути від 2х і більше.
// Приклад роботи:
// 1.	max(5,-2) – має повернути 5.
// 2.	max(5,-2, 30, 6) – має повернути 30
let max = function (...arg) {
    let result = arg[0];
    for (let i = 0; i < arg.length; i++) {
        if (arg[i] > result) {
            result = arg[i];
        }
    }
    return result;
};
console.log(max(-3, 0, 4, -34, 15, -2));
// ------------------------------------------------------------------------------------------Завдання 4
// Завдання 4
// Напишіть функцію getSqrt(number), яка вираховує корінь квадратний. Для визначення кореня використовуйте Math. 
// В залежності від того що передали в функцію має виводити наступні повідомлення:
// •	Якщо передане число повертати - Квадратний корінь з стільки то дорівнює стільки то.
// •	Якщо передали не число - Повинно бути числове значення.
// •	Якщо число менше 0 - Введіть додатнє число.
// •	Якщо в функцію нічого не передали - Будь ласка, введіть число!
let a = prompt('Введіть число');
function getSqrt(n) {
    if (isNaN(n) == false && n >= 0 && n != '') {
        let sq = Math.sqrt(n);
        return `Квадратний корінь з ${n} дорівнює ${sq}`;
    }
    else if (isNaN(n) == true) {
        return `Повинно бути числове значення`;
    }
    else if (isNaN(n) == false && n < 0) {
        return `Введіть додатнє число`;
    }
    else {
        return `Будь ласка, введіть число!`;
    }
}
console.log(getSqrt(a));
